app/controllers/header_links_controller.rb

SELECT `header_links`.* FROM `header_links` WHERE `header_links`.`id` = 1 LIMIT 1
---
  def show
    @header_link = HeaderLink.find(params[:id])