app/controllers/home_controller.rb

SELECT `main_sliders`.* FROM `main_sliders`
SELECT `infos`.* FROM `infos` WHERE (header_link_id IS NULL)
---
  def index
#    @users = User.all
    @main_sliders = MainSlider.all
    @infos = Info.where("header_link_id IS NULL")