app/controllers/infos_controller.rb

SELECT `infos`.* FROM `infos`
---
  def index
    @infos = Info.all

INSERT INTO `infos` (`content`, `created_at`, `header_link_id`, `highlight`, `slug`, `title`, `updated_at`) VALUES ('<p>Founded in August of 2008 and based in San Francisco, California, Airbnb is a trusted community marketplace for people to list, discover, and book unique accommodations around the world &mdash; online or from a mobile phone. Whether an apartment for a night, a castle for a week, or a villa for a month, Airbnb connects people to unique travel experiences, at any price point, in more than 26,000 cities and 192 countries. And with world-class customer service and a growing community of users, Airbnb is the easiest way for people to monetize their extra space and showcase it to an audience of millions.</p>', '2012-08-12 10:06:57', NULL, '<p>Founded in August of 2008 and based in San Francisco, California, Airbnb is a trusted community marketplace for people to list, discover, and book unique accommodations around the world &mdash; online or from a mobile phone. Whether an apartment for a night, a castle for a week, or a villa for a month, Airbnb connects people to unique travel experiences, at any price point, in more than 26,000 cities and 192 countries.</p>', 'mantap-sekali-info', 'Mantap Sekali Info', '2012-08-12 10:06:57')
---
  def create
    @info = Info.new(params[:info])

    respond_to do |format|
      if @info.save