app/controllers/main_sliders_controller.rb

  def index
    @main_sliders = MainSlider.all
---
SELECT `main_sliders`.* FROM `main_sliders`

  def create
    @main_slider = MainSlider.new(params[:main_slider])

    respond_to do |format|
      if @main_slider.save
---
INSERT INTO `main_sliders` (`created_at`, `description`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `updated_at`) VALUES ('2012-08-14 10:09:38', '', 'image/jpeg', '70-Photos-That-Will-Take-Your-Breath-Away4.jpg', 63422, '2012-08-14 10:09:38', '2012-08-14 10:09:38')

  def destroy
    @main_slider = MainSlider.find(params[:id])

    if @main_slider.destroy
---
SELECT `main_sliders`.* FROM `main_sliders` WHERE `main_sliders`.`id` = 3 LIMIT 1
DELETE FROM `main_sliders` WHERE `main_sliders`.`id` = 3