app/controllers/product_categories_controller.rb

  def show
    @product_category = ProductCategory.find(params[:id])
    @products = Product.where("product_category_id IN(?)", @product_category.descendant_ids << @product_category.id)
---
SELECT `product_categories`.* FROM `product_categories` WHERE `product_categories`.`id` IN (1) ORDER BY (case when product_categories.ancestry is null then 0 else 1 end), product_categories.ancestry
SELECT `products`.* FROM `products` WHERE (product_category_id IN(6,7,5))