app/controllers/products_controller.rb

  def index
    @products = Product.where("name LIKE ?", "%#{params[:name]}%")
    @products = @products.where("is_package = ?", params[:is_package] == 'true' ? 1 : 0) unless params[:is_package].blank?
    @products = @products.page(params[:page]).per(10).order("created_at DESC")
---
SELECT COUNT(*) FROM `products` WHERE (name LIKE '%%')
SELECT `products`.* FROM `products` WHERE (name LIKE '%%') ORDER BY created_at DESC LIMIT 10 OFFSET 0

  def show
    @product = Product.find(params[:id])
    @product_packages = ProductPackage.where(:parent_id => params[:id])
    @product_images = ProductImage.where(:product_id => params[:id])
---
SELECT `products`.* FROM `products` WHERE `products`.`id` = 2 LIMIT 1
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` = 2 LIMIT 1