app/views/infos/_form.html.erb

      <div class="controls">
        <%= f.select :header_link_id, options_from_collection_for_select(HeaderLink.all, :id, :name), :include_blank => true %>
---
SELECT `header_links`.* FROM `header_links`