app/views/layouts/_navigation.html.erb

SELECT `header_links`.* FROM `header_links`
---
  <% else %>
    <% HeaderLink.all.each do |hl| %>